/*
	자바도 일반적인 응용프로그램 처럼 데이터를 메모리에 올릴 때 즉 변수 선언시
	해당 데이터에 대한 정확한 자료형을 명시해야 컴파일에러가 나지 않는다.
	
	모든 프로그래밍 언어에서 기본 자료형은 단 3가지 유형으로 분류된다
	[기본 primitive 자료형] - 8가지 자료형은 각자 메모리에 차지하는 용량이 있다.
	- 아래의 모든 자료형의 단위는 바이트(byte)이다
	
	1) 숫자
		- 실수 float(4) < double(8)

		- 정수 byte(1) < short(2) < int(4) < long(8)
	
	2) 문자 char(2)
		ex) char c = '안'; //문자는 홑따옴표 사용함
		
	3) 논리값 boolean(1)     
		ex) boolean b = true;  //주의 c,js와는 달리 자바언어에서는 1과 0이 논리값을 대신 할 수 없다!!
											//오직 true/false만 넣을 수있다
*/

class DataType1{
	
}